app/services/search_movie.rb

	def save
	  movie = Movie.new
	  movie.title = @title
	  movie.director = @director
	  movie.realease_date = @release_date
		#movie.poster_path = @poster_path
	  movie.save
---
INSERT INTO "movies" ("title", "director", "realease_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The Avengers"], ["director", "Joss Whedon"], ["realease_date", "2012-04-25"], ["created_at", "2018-11-14 02:27:13.008983"], ["updated_at", "2018-11-14 02:27:13.008983"]]