app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%Inception%')
---
  def create
  	word = params[:word]
  	SearchMovie.new(word).perform
    @movies = Movie.where("title ILIKE ?", "%#{word}%")